In [1]:
import pandas as pd
import numpy as np

In [6]:
dict1 = {
    "Name" : ['Yash','Mohan','Sohan','Ravi'],
    "Marks" : ['95','91','89','75'],
    "City" : ['Ankleshwar','Mathura','Agra','Bombay']
}

In [7]:
df = pd.DataFrame(dict1)

In [8]:
print(df)

    Name Marks        City
0   Yash    95  Ankleshwar
1  Mohan    91     Mathura
2  Sohan    89        Agra
3   Ravi    75      Bombay

In [9]:
df

    Name Marks        City
0   Yash    95  Ankleshwar
1  Mohan    91     Mathura
2  Sohan    89        Agra
3   Ravi    75      Bombay

In [12]:
# Created csv file
df.to_csv('friends.csv')

In [13]:
# Created csv file - without index 
df.to_csv('friends_NoIndex.csv', index = False)

In [14]:
# Shows starting two elements
df.head(2)

    Name Marks        City
0   Yash    95  Ankleshwar
1  Mohan    91     Mathura

In [15]:
# Shows last two elements
df.tail(2)

    Name Marks    City
2  Sohan    89    Agra
3   Ravi    75  Bombay

In [16]:
# Do math on mmeric row - Gives mean, count, standard deviation etc..
df.describe()

        Name Marks        City
count      4     4           4
unique     4     4           4
top     Yash    95  Ankleshwar
freq       1     1           1

In [19]:
# Reading cvs file
Trains = pd.read_csv('trains.csv')

In [20]:
Trains

   TRIN NO  SPEED        City
0    12345     95  Ankleshwar
1    34321     91     Mathura
2    56435     89        Agra
3    76543     75      Bombay

In [21]:
Trains['SPEED'][0]

95

In [22]:
Trains['SPEED'][0] = 50

/var/folders/k9/r58sn53s63gcnc3v_h7v79p00000gn/T/ipykernel_25933/4206724041.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Trains['SPEED'][0] = 50

In [23]:
Trains['SPEED'][0]

50

In [24]:
# for updating changes in our csv file
Trains.to_csv('trains.csv')

In [25]:
Trains.index = ['first','second','third','fourth']

In [27]:
Trains

        TRIN NO  SPEED        City
first     12345     50  Ankleshwar
second    34321     91     Mathura
third     56435     89        Agra
fourth    76543     75      Bombay

In [31]:
# Created a Series datatype
ser = pd.Series(np.random.rand(9))

In [32]:
ser

0    0.374182
1    0.002248
2    0.167165
3    0.558495
4    0.616997
5    0.642973
6    0.466844
7    0.176358
8    0.396223
dtype: float64

In [30]:
type(ser)

pandas.core.series.Series

In [33]:
# Created a DataFrame datatype
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))

In [34]:
newdf.head()

          0         1         2         3         4
0  0.427368  0.415699  0.324337  0.002385  0.705661
1  0.800632  0.459401  0.332987  0.620213  0.669441
2  0.495037  0.662759  0.454294  0.569944  0.087079
3  0.404527  0.546184  0.357670  0.955163  0.929557
4  0.509068  0.751678  0.676991  0.766693  0.946998

In [36]:
newdf

            0         1         2         3         4
0    0.427368  0.415699  0.324337  0.002385  0.705661
1    0.800632  0.459401  0.332987  0.620213  0.669441
2    0.495037  0.662759  0.454294  0.569944  0.087079
3    0.404527  0.546184  0.357670  0.955163  0.929557
4    0.509068  0.751678  0.676991  0.766693  0.946998
..        ...       ...       ...       ...       ...
329  0.027780  0.802039  0.873444  0.909959  0.445557
330  0.474387  0.762668  0.889079  0.982846  0.858829
331  0.825311  0.569079  0.603017  0.372832  0.572497
332  0.965968  0.668327  0.061887  0.778936  0.184724
333  0.850508  0.227443  0.947153  0.239333  0.491958

[334 rows x 5 columns]

In [37]:
type(newdf)

pandas.core.frame.DataFrame

In [38]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.485186    0.500844    0.485980    0.525380    0.506901
std      0.294945    0.277056    0.286533    0.299874    0.287665
min      0.000730    0.000780    0.003610    0.002385    0.000571
25%      0.229851    0.252567    0.225620    0.254268    0.271864
50%      0.479030    0.510103    0.482498    0.522180    0.512723
75%      0.752429    0.739946    0.720063    0.789176    0.738094
max      0.994873    0.997171    0.997285    0.998288    0.997408

In [40]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [41]:
newdf[0][0] = 'Yash'

In [42]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [43]:
newdf.head()

          0         1         2         3         4
0      Yash  0.415699  0.324337  0.002385  0.705661
1  0.800632  0.459401  0.332987  0.620213  0.669441
2  0.495037  0.662759  0.454294  0.569944  0.087079
3  0.404527  0.546184  0.357670  0.955163  0.929557
4  0.509068  0.751678  0.676991  0.766693  0.946998

In [44]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [45]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [46]:
# Converting to Numpy array
newdf.to_numpy()

array([['Yash', 0.415699368038021, 0.3243374235027444,
        0.0023845533687553155, 0.7056605987446832],
       [0.8006315953029987, 0.45940080594163357, 0.33298709411389826,
        0.6202126220869499, 0.6694412926988637],
       [0.49503693972941565, 0.6627592749880318, 0.4542944257675553,
        0.5699442436887103, 0.0870786314128984],
       ...,
       [0.8253107326722026, 0.5690793082628004, 0.6030166296624351,
        0.37283192024423006, 0.5724967676788338],
       [0.9659679050506189, 0.668327179677941, 0.061887320176378324,
        0.7789355914095931, 0.1847242733155634],
       [0.8505082805924775, 0.2274431142366271, 0.9471529915626629,
        0.2393328605606454, 0.4919575372500885]], dtype=object)